table = { "H" => "Кавендиш",
          "He" => "Локьер, Жансен, Рамзай",
          "Li" => "Арфведсон",
          "Be" => "Воклен",
          "B" => "Дэви и Гей-Люссак",
          "C" => "неизвестен",
          "N" => "Резерфорд",
          "O" => "Пристли и Шееле",
          "F" => "Муассан",
          "Ne" => "Рамзай и Траверс" }
puts "у нас всего элементов: #{table.keys.size}"
puts table.keys
puts "о каком вы хотели бы узнать"
user = STDIN.gets.chomp
if table.key?(user)
  puts table[user]
else
  puts "введите правильно название элемента"
end
